01.	将服务器文件下载到本地
================================================================================

# 切换工作目录
$ cd 经理的工作目录
# checkout服务器上的代码仓库
$ svn co http://192.168.1.103/svn/weibo --username=manager --password=manager

提示：checkout(co)之后，命令行会记录用户名和密码，后续操作不用再另行指定

02.	经理添加文件
================================================================================

* svn 常用命令
--------------------------------------------------------------------------------
# 查看本地代码库状态
$ svn st
错误提示："is not a working copy"，必须在svn的工作目录下才能正确使用svn的命令
# 查看svn日志
$ svn log
# 查看某一个文件的日志
$ svn log filename
# 查看某一个文件某个版本的日志
$ svn log filename@1

* 创建文件
--------------------------------------------------------------------------------
# 切换到工作目录
$ cd weibo
# 创建文件
$ touch main.c
# 打开并编写文件内容
$ open main.c

* 将文件提交到服务器
--------------------------------------------------------------------------------
# 查看工作目录状态
$ svn st
# 将文件添加到本地版本库中
$ svn add main.c
# 将文件提交到服务器的版本库中
$ svn ci -m "添加了main.c文件"

"小结" - 添加文件的两个步骤
--------------------------------------------------------------------------------
1>  将新建的文件添加到本地代码库
$ svn add main.c
2>  将刚刚添加的文件提交到服务器
$ svn ci -m "备注信息"

注意：一定要养成写注释的良好习惯

03.	团队成员加入
================================================================================

1>  张三
$ svn co http://10.0.1.15/svn/weibo --username=zhangsan --password=zhangsan
2>  李四
$ svn co http://10.0.1.15/svn/weibo --username=lisi --password=lisi

"小结" 至此，一个项目的搭建工作就告一段落了
1> 项目准备工作，通常由项目经理完成
2> 程序员只需要把项目 co 到本地即可

提示：新入职一家公司后，别忘记让经理分配 svn 的账号和密码

04.	张三添加文件
================================================================================

# 添加文件 Person.h Person.m
$ touch Person.h Person.m
# 修改 Person.h Person.m
$ open Person.h
$ open Person.m
# 将 Person.h Person.m 添加到本地代码库
$ svn add Person.*
# 将内容提交到服务器
$ svn ci -m "添加了Person类"

05. 删除文件
================================================================================

# 删除文件
$ svn rm Person.h
# 提交删除
$ svn ci -m "删除了文件"

注意：不要使用文件管理器直接删除文件

06. 撤销修改
================================================================================
$ svn revert Person.m

07. 恢复到之前的某个版本
$ svn update -r 5
================================================================================
$ svn up

08. 冲突解决
(p) postpone            对比
(mc) mine-conflict      使用我的
(tc) theirs-conflict    使用对方的




